&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//КлёвыйBotОбработатьЗапросыНаСервере();
	ВыполнитьЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаданияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Боты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Боты КАК Боты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Боты.ОбработатьЗапросКБоту(Выборка.Ссылка);
	КонецЦикла;
	
	//Боты.ПланЧтения();
	//Боты.ИнфоБот();
	
КонецПроцедуры

