
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийМастер = ПолучитьТекущегоМастераНаСервере();
	Если ТекущийМастер = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ТекущийМастер;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоМастераНаСервере()
	
	ТекущийМастер =  Регистратура.ПолучитьМастераПоЛогину(ПараметрыСеанса.ТекущийПользователь);
	
	Если ТекущийМастер = Справочники.Мастера.ПустаяСсылка() Тогда
		Возврат Неопределено;
	Иначе 
		Возврат ТекущийМастер;
	КонецЕсли;
	
КонецФункции

