
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВидФорматирования = Перечисления.ВидФорматирования.БезФорматирования;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТекстСообщения = ТекущийОбъект.ФорматированныйТекст.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ФорматированныйТекст = Новый ХранилищеЗначения(ТекстСообщения);
КонецПроцедуры

&НаСервере
Процедура ПоказатьХТМЛНаСервере()
	ТекстХТМЛ = "";
	ТекстСообщения.ПолучитьHTML(ТекстХТМЛ, Новый Структура);
	Сообщить(ТекстХТМЛ);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьХТМЛ(Команда)
	ПоказатьХТМЛНаСервере();
КонецПроцедуры
