Перем глОбщиеЗначения Экспорт;

Процедура ПриНачалеРаботыСистемы()
	
	//мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	//
	////ПроверитьПодключениеОбработчикаОжидания();
	//
	//ЭтоФайловаяИБ = ОпределитьЭтаИнформационнаяБазаФайловая();
	//	
	//Если ЭтоФайловаяИБ Тогда
	//				
	//	ПользовательДляВыполненияРеглЗаданий = глЗначениеПеременной("ПользовательДляВыполненияРегламентныхЗаданийВФайловомВарианте");
	//	
	//	Если мТекущийПользователь = ПользовательДляВыполненияРеглЗаданий тогда // ПользовательДляВыполненияРеглЗаданий
			
			// с интервалом секунд вызываем процедуру работы с регламентными заданиями
			ПоддержкаРегламентныхЗаданиеДляФайловойВерсии();
			
			ПодключитьОбработчикОжидания("ПоддержкаРегламентныхЗаданиеДляФайловойВерсии", глЗначениеПеременной("глКоличествоСекундОпросаОбмена"));
			
			//ИнтервалДляОпроса = Константы.ИнтервалДляОпросаРегламентныхЗаданийВФайловомВарианте.Получить();
			////глЗначениеПеременной("глКоличествоСекундОпросаОбмена")
			//Если ИнтервалДляОпроса = Неопределено
			//	ИЛИ ИнтервалДляОпроса = 0 Тогда
			//	
			//	ИнтервалДляОпроса = 60;	
			//	
			//КонецЕсли;
			
			
	//	Иначе 
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
	ОбщегоНазначения.ПередНачаломРаботыСистемыНаСервере();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

// процедура служит для поддержки работы регламентных заданий в файловой версии
Процедура ПоддержкаРегламентныхЗаданиеДляФайловойВерсии() Экспорт
	
	ВыполнитьОбработкуЗаданий();
	
КонецПроцедуры

// Функция возвращает значение экспортных переменных модуля приложенийа
//
// Параметры
//  Имя - строка, содержит имя переменной целиком 
//
// Возвращаемое значение:
//   значение соответствующей экспортной переменной
Функция глЗначениеПеременной(Имя) Экспорт
		
	Возврат ОбщегоНазначения.ПолучитьЗначениеПеременной(Имя, глОбщиеЗначения);
	
КонецФункции

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	//ОбщегоНазначения.ПередНачаломРаботыСистемыНаСервере();
	//ОбновитьИнтерфейс();
	
КонецПроцедуры


