
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если РольДоступна("Мастер") Тогда
	//	Элементы.Код.Доступность = Ложь;
	//	Элементы.Идентификатор.Доступность = Ложь;
	//	Элементы.Работает.Доступность = Ложь;
	//	Элементы.Логин.Доступность = Ложь;
	//	Элементы.Бот.Доступность = Ложь;
	//	
	//	Если НапоминаниеОЗаписи Тогда
	//		Элементы.ВремяНапоминанияОЗаписи.Видимость = Истина;
	//	Иначе 
	//		Элементы.ВремяНапоминанияОЗаписи.Видимость = Ложь;
	//	КонецЕсли;
	//КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НапоминаниеОЗаписиПриИзменении(Элемент)
	
	Если НапоминаниеОЗаписи Тогда
		Элементы.ВремяНапоминанияОЗаписи.Видимость = Истина;
	Иначе 
		Элементы.ВремяНапоминанияОЗаписи.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если НЕ МобильноеПриложениеСервер Тогда
		Если РольДоступна("Мастер") Тогда
			Элементы.Код.Доступность = Ложь;
			Элементы.Идентификатор.Доступность = Ложь;
			Элементы.Работает.Доступность = Ложь;
			Элементы.Логин.Доступность = Ложь;
			Элементы.Бот.Доступность = Ложь;
			
			Если НапоминаниеОЗаписи Тогда
				Элементы.ВремяНапоминанияОЗаписи.Видимость = Истина;
			Иначе 
				Элементы.ВремяНапоминанияОЗаписи.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;     	
	#КонецЕсли
	
КонецПроцедуры

