////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ТекущийМастер") Тогда
		ТекущийМастер = Параметры.ТекущийМастер;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШагуМастераНаСервере()
	
	ВремяЗаписи.Очистить();
	
	НовоеВремяЗаписи = ТекущийМастер.ВремяПервогоПриема;
	
	Пока НовоеВремяЗаписи <= ТекущийМастер.ВремяПоследнегоПриема Цикл
		ВремяЗаписи.Добавить(НовоеВремяЗаписи);
		НовоеВремяЗаписи = НовоеВремяЗаписи + ТекущийМастер.ШагЗаписи * 60;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШагуМастера(Команда)
	ЗаполнитьПоШагуМастераНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть(Команда)
	Закрыть(ВремяЗаписи);
КонецПроцедуры
