
Процедура УдалениеНеЗаконченныхЗаписей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаписьНаПрием.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаписьНаПрием КАК ЗаписьНаПрием
		|ГДЕ
		|	ЗаписьНаПрием.Проведен = ЛОЖЬ
		|	И ЗаписьНаПрием.Дата < &ДатаВремя";
	
	Запрос.УстановитьПараметр("ДатаВремя", ТекущаяДата() - Константы.ВремяУдаленияЗаписей.Получить()*60);
	                                                    
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

