
Процедура ПроведениеЗаписьНаПриемОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Если НЕ Отказ Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаписиНаПрием.Мастер КАК Мастер,
	//	|	ЗаписиНаПрием.Контрагент КАК Контрагент,
	//	|	ЗаписиНаПрием.Номекнлатура КАК Номекнлатура,
	//	|	ЗаписиНаПрием.ДатаВремяЗаписи КАК ДатаВремяЗаписи
	//	|ИЗ
	//	|	РегистрСведений.ЗаписиНаПрием КАК ЗаписиНаПрием
	//	|ГДЕ
	//	|	ЗаписиНаПрием.Регистратор = &Регистратор
	//	|ИТОГИ ПО
	//	|	Мастер,
	//	|	Контрагент";
	//	
	//	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаМастер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Мастер");
	//	
	//	Пока ВыборкаМастер.Следующий() Цикл
	//		Мастер = ВыборкаМастер.Мастер; 
	//		
	//		ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	//		
	//		Пока ВыборкаКонтрагент.Следующий() Цикл
	//			Контрагент = ВыборкаКонтрагент.Контрагент;
	//			
	//			ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
	//			
	//			ТекстСообщения = "<b>НовийЗапис:</b>" + Символы.ПС  
	//			+ Контрагент + Символы.ПС;
	//			
	//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//				ТекстСообщения = ТекстСообщения + ВыборкаДетальныеЗаписи.ДатаВремяЗаписи + " - " + ВыборкаДетальныеЗаписи.Номекнлатура + Символы.ПС;
	//			КонецЦикла;
	//			
	//		КонецЦикла;
	//	КонецЦикла;
	//	
	//	НастройкиБотаМастера = Мастер.Бот;
	//	
	//	Телеграм = Обработки.Телеграм.Создать();
	//	Телеграм.Бот = НастройкиБотаМастера;
	//	//Телеграм.getUpdate();
	//	
	//	ОбработкаБота = Обработки.Найти(НастройкиБотаМастера.Обработка).Создать();
	//	ОбработкаБота.Телеграм = Телеграм;
	//	ОбработкаБота.Бот = НастройкиБотаМастера;
	//	ОбработкаБота.ОповеститьМастера(Мастер.Идентификатор, ТекстСообщения);
	//	
	//КонецЕсли; 
	
			
КонецПроцедуры

Процедура ПодпискаНаСобытие1ПриЗаписи(Источник, Отказ) Экспорт
	
	//Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаписиНаПрием.Мастер КАК Мастер,
	//	|	ЗаписиНаПрием.Контрагент КАК Контрагент,
	//	|	ЗаписиНаПрием.Номекнлатура КАК Номекнлатура,
	//	|	ЗаписиНаПрием.ДатаВремяЗаписи КАК ДатаВремяЗаписи
	//	|ИЗ
	//	|	РегистрСведений.ЗаписиНаПрием КАК ЗаписиНаПрием
	//	|ГДЕ
	//	|	ЗаписиНаПрием.Регистратор = &Регистратор
	//	|ИТОГИ ПО
	//	|	Мастер,
	//	|	Контрагент";
	//	
	//	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаМастер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Мастер");
	//	
	//	Пока ВыборкаМастер.Следующий() Цикл
	//		Мастер = ВыборкаМастер.Мастер; 
	//		
	//		ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	//		
	//		Пока ВыборкаКонтрагент.Следующий() Цикл
	//			Контрагент = ВыборкаКонтрагент.Контрагент;
	//			
	//			ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
	//			
	//			ТекстСообщения = "<b>НовийЗапис:</b>" + Символы.ПС  
	//			+ Контрагент + Символы.ПС;
	//			
	//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//				ТекстСообщения = ТекстСообщения + ВыборкаДетальныеЗаписи.ДатаВремяЗаписи + " - " + ВыборкаДетальныеЗаписи.Номекнлатура + Символы.ПС;
	//			КонецЦикла;
	//			
	//		КонецЦикла;
	//	КонецЦикла;
	//	
	//	НастройкиБотаМастера = Мастер.Бот;
	//	
	//	Телеграм = Обработки.Телеграм.Создать();
	//	Телеграм.Бот = НастройкиБотаМастера;
	//	//Телеграм.getUpdate();
	//	
	//	ОбработкаБота = Обработки.Найти(НастройкиБотаМастера.Обработка).Создать();
	//	ОбработкаБота.Телеграм = Телеграм;
	//	ОбработкаБота.Бот = НастройкиБотаМастера;
	//	ОбработкаБота.ОповеститьМастера(Мастер.Идентификатор, ТекстСообщения);
	//
	
КонецПроцедуры
