////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ВСЕХ БОТОВ
//

Функция ПолучитьДанныеСообщения(Бот, Идентификатор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗапросыБоту.ДанныеЗапроса
	|ИЗ
	|	РегистрСведений.ЗапросыБоту КАК ЗапросыБоту
	|ГДЕ
	|	ЗапросыБоту.update_id = &updateid
	|	И ЗапросыБоту.Бот = &Бот";
	Запрос.УстановитьПараметр("updateid", Идентификатор);
	Запрос.УстановитьПараметр("Бот", Бот);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ДанныеЗапроса.Получить();

КонецФункции // ПолучитьДанныеСообщения()

Процедура ЗакрытьСообщение(Бот, Идентификатор) Экспорт

	Запись = РегистрыСведений.ЗапросыБоту.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.update_id = Идентификатор;
	Запись.Прочитать();
	Запись.Обработан = Истина;
	Запись.Записать();

КонецПроцедуры