&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.Обработка.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокОбработок());

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокОбработок()

	МассивОбработок = Новый Массив;
	Для каждого Обработка Из Метаданные.Обработки Цикл

		Если Прав(Обработка.Имя, 3) = "Bot" Тогда
			МассивОбработок.Добавить(Обработка.Имя);
		КонецЕсли;

	КонецЦикла;

	Возврат МассивОбработок;

КонецФункции // 


&НаКлиенте
Процедура ЗадатьURL(Команда)
	
	ok = Ложь;
	
	Если Объект.Ссылка.Пустая() или Модифицированность Тогда
		Сообщить("Сначала следует записать элемент", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ЗадатьURLНаСервере(ok);
	
	Объект.УстановленWebHook = ok;
	
	Попытка
		Записать();
	Исключение
		Сообщить("Не удалось записать объект """ + Объект + """!
                   |" + ОписаниеОшибки(), 60);
	КонецПопытки;
	
	Сообщить( "Установка URL "+?(ok,"","не ")+"выполнена");
	
КонецПроцедуры

&НаСервере
Процедура ЗадатьURLНаСервере(ok)
	
	Телеграм = Обработки.Телеграм.Создать();
	Телеграм.Бот = Объект.Ссылка;
	Телеграм.setWebhook(ok);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВэбХукНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Сначала следует записать элемент", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Телеграм = Обработки.Телеграм.Создать();	 
	Телеграм.Бот = Объект.Ссылка;
	ok = Ложь;
	Телеграм.deleteWebhook(ok);
	Объект.УстановленWebHook = (ok = Ложь);
	
	Попытка
		Записать();
	Исключение
		Сообщить("Не удалось записать объект """ + Объект + """!
                   |" + ОписаниеОшибки(), 60);
	КонецПопытки;
	
	Сообщить( "Удаление URL "+?(ok,"","не ")+"выполнено");

КонецПроцедуры


&НаКлиенте
Процедура УдалитьВэбХук(Команда)
	УдалитьВэбХукНаСервере();
КонецПроцедуры


