&НаСервереБезКонтекста
Процедура ПостБожьяБлагодатьВКаналНаСервере()
	Боты.ПостБожьяБлагодатьВКанал();
КонецПроцедуры

&НаКлиенте
Процедура ПостБожьяБлагодатьВКанал(Команда)
	ПостБожьяБлагодатьВКаналНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПостБожьяБлагодатьВГруппуНаСервере()
	Боты.ПостБожьяБлагодатьВГруппу();
КонецПроцедуры

&НаКлиенте
Процедура ПостБожьяБлагодатьВГруппу(Команда)
	ПостБожьяБлагодатьВГруппуНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПостПланЧтенияНаСервере()
	Боты.ПостПланЧтения();
КонецПроцедуры

&НаКлиенте
Процедура ПостПланЧтения(Команда)
	ПостПланЧтенияНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьЗапросыНаСервере()
	
	АПИТелеграм = Обработки.Телеграм.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Боты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Боты КАК Боты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		АПИТелеграм.Бот = Выборка.Ссылка;
		
		ДвижокБота = Обработки[Выборка.Ссылка.Обработка].Создать();
		ДвижокБота.Телеграм = АПИТелеграм;
		
		АПИТелеграм.ОбработатьАпдейты(ДвижокБота);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗапросы(Команда)
	ОбработатьЗапросыНаСервере();
КонецПроцедуры
