
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЗаписиНаПрием
	Если ВремяЗаписи.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Движения.ЗаписиНаПрием.Записывать = Истина;
	Для Каждого ТекСтрокаВремяЗаписи Из ВремяЗаписи Цикл
		Движение = Движения.ЗаписиНаПрием.Добавить();
		Движение.Мастер = ТекСтрокаВремяЗаписи.Мастер;
		Движение.Контрагент = Контрагент;
		Движение.Номекнлатура = ТекСтрокаВремяЗаписи.Номенклатура;
		Движение.ДатаВремяЗаписи = ТекСтрокаВремяЗаписи.ДатаВремяЗаписи;
		//Движение.ВремяЗаписи = ТекСтрокаВремяЗаписи.ВремяЗаписи;
		Движение.ТипЗаписиНаПрием = ТекСтрокаВремяЗаписи.ТипЗаписиНаПрием;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;		
	
	стрКонтрагент = Боты.НайтиКлиентаПоИДТелеграм(ДанныеЗаполнения);
	
	Если НЕ стрКонтрагент.Существует Тогда
		Возврат;
	КонецЕсли;
	
	Дата = ТекущаяДата();
	ИДКонтрагента = ДанныеЗаполнения;
	Контрагент = стрКонтрагент.Контрагент;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Процедура ДобавитьКоличество
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ДобавитьНоменклатуру(Мастер, Номенклатура) Экспорт
	
	// Ищем выбранную позицию в таблице подобранной номенклатуры.
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Мастер", Мастер);
	СтруктураОтбора.Вставить("Номенклатура", Номенклатура);
	СтрокаТабличнойЧасти = ОбработкаТабличныхЧастей.НайтиСтрокуТабЧасти(ВремяЗаписи, СтруктураОтбора);
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		// уже есть, значит повторно выбрали строку для снятия отметки о выборе
		// нужно удалить строку 
		ВремяЗаписи.Удалить(СтрокаТабличнойЧасти);
	Иначе
		// Не нашли - добавляем новую строку.
		СтрокаТабличнойЧасти = ВремяЗаписи.Добавить();
		СтрокаТабличнойЧасти.Мастер = Мастер;
		СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
		СтрокаТабличнойЧасти.Длительность = Номенклатура.Длительность;
		СтрокаТабличнойЧасти.Цена = Номенклатура.Цена;
		СтрокаТабличнойЧасти.ТипЗаписиНаПрием   = Перечисления.ТипыЗаписейНаПрием.Телеграм;
	КонецЕсли;
	
	//ИзмКоличество(СтрокаТабличнойЧасти);
	
КонецПроцедуры //ДобавитьКоличество

Процедура ЗаписатьВремя(Мастер, Знач ЗаписьНаДату) Экспорт
	
	ЗаписьНаДату = Дата(ЗаписьНаДату);
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Мастер", Мастер);
	//СтруктураОтбора.Вставить("Номенклатура", Справочники.НоменклатураМастеров.ПустаяСсылка());
	строкиТабЧасти = ВремяЗаписи.НайтиСтроки(СтруктураОтбора);
	
	Если строкиТабЧасти.Количество() > 0 Тогда
		Для каждого строкаТЧ Из строкиТабЧасти Цикл
			строкаТЧ.ДатаВремяЗаписи = ЗаписьНаДату;
			ЗаписьНаДату = ЗаписьНаДату + строкаТЧ.Длительность*60;
		КонецЦикла;
	КонецЕсли;                     
	
КонецПроцедуры

//Процедура ИзмКоличество(стрТовары) Экспорт
//	
//	Цена = МодульТелеграмСлужебный.ПолучитьЦену(Дата, стрТовары.Номенклатура, ТипЦен);
//	
//	стрТовары.Цена = Цена;
//	стрТовары.Сумма = стрТовары.Количество*стрТовары.Цена*стрТовары.Коэффициент;
//	
//КонецПроцедуры

